# TonnesForce Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..TonnesForce Property
UnitTypeId Class See Also
---
Tonnes force.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TonnesForce { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TonnesForce As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TonnesForce {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace